tap "argoproj/tap"
tap "derailed/k9s"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "instrumenta/instrumenta"
tap "mongodb/brew"
tap "vektra/tap"
tap "weaveworks/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
brew "dive"
# Key value store for shared configuration and service discovery
brew "etcd"
# Modern replacement for 'ls'
brew "exa"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Kubernetes package manager
brew "helm"
# Time series, events, and metrics database
brew "influxdb"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Domain specific configuration language for defining JSON data
brew "jsonnet"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Build and deploy Go applications on Kubernetes
brew "ko"
# Lazier way to manage everything docker
brew "lazydocker"
# Run a Kubernetes cluster locally
brew "minikube"
# Command-line collection runner for Postman
brew "newman"
# Outputs current CPU temperature for OSX
brew "osx-cpu-temp"
# Shell command parallelization utility
brew "parallel"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Flexible, reusable and concise configuration for Kubernetes using Jsonnet
brew "tanka"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# HTTP load testing tool and library
brew "vegeta"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# Tracks most-used directories to make cd smarter
brew "z"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Validate your Kubernetes configurations
brew "instrumenta/instrumenta/kubeval"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
# The official CLI for Amazon EKS
brew "weaveworks/tap/eksctl"

# Cask programs
cask "alacritty"
cask "docker"
cask "google-cloud-sdk"
cask "google-chrome"
cask "postman"
cask "visual-studio-code"
cask "robo-3t"
cask "slack"
cask "discord"
cask "lens"